#include <iostream>
#include <cmath>

using namespace std;
int main()

{
	/*
	 1)Если остаток от деления Х на 5 равен 2, то присвоить Х значение 0, если остаток равен 3, то умножить Х на –1.
	 
	 2)Если Х равно 5, то присвоить Y квадрат Х, если 7, то У присвоить остаток от деления Х на 2, в остальных случаях значение Y увеличить на 1.
	 
	 3)Если Х больше 5, то увеличить его значение на 1, иначе вывести на печать У. Х и Y целые. - НЕЛЬЗЯ РЕШИТЬ!
	 
	 Ответ: 1 и 2 можно решить через switch, а 3 задачу невозможно
	*/
	
}
